CommunityGD32Cores/platform-gd32/misc/svd/GD32F20x_CL.svd
       </registers>
    </peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <description>Analog to digital converter</description>
      <baseAddress>0x40012800</baseAddress>
      <interrupt>
        <name>ADC0_1</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC2</name>
      <baseAddress>0x40013C00</baseAddress>
      <interrupt>
        <name>ADC2</name>
        <value>47</value>
      </interrupt>
    </peripheral>
<peripheral>
      <name>AFIO</name>
      <description>Alternate-function I/Os</description>
      <groupName>AFIO</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EC</name>
          <displayName>EC</displayName>
          <description>Event control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EOE</name>
              <description>Event output enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PORT</name>
              <description>Event output port selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PIN</name>
              <description>Event output pin selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCF0</name>
          <displayName>PCF0</displayName>
          <description>AFIO port configuration register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PTP_PPS_REMAP</name>
              <description>Ethernet PTP PPS remapping</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1ITR0_REMAP</name>
              <description>TIMER1 internal trigger 0 remapping</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2_REMAP</name>
              <description>SPI2/I2S2 remapping</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWJ_CFG</name>
              <description>Serial wire JTAG configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ENET_PHY_SEL</name>
              <description>Ethernet MII or RMII PHY selection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAN1_REMAP</name>
              <description>CAN1 I/O remapping</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENET_REMAP</name>
              <description>Ethernet MAC I/O remapping</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC1_ETRGREG_REMAP</name>
              <description>ADC 1 external trigger regular conversion remapping</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC1_ETRGINS_REMAP</name>
              <description>ADC 1 external trigger inserted  conversion remapping</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC0_ETRGREG_REMAP</name>
              <description>ADC 0 external trigger regular  conversion remapping</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC0_ETRGINS_REMAP</name>
              <description>ADC 0 external trigger inserted  conversion remapping</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>TIMER4CH3_IREMAP</name>
              <description>TIMER4 channel3 internal remapping</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD01_REMAP</name>
              <description>Port D0/Port D1 mapping on OSC_IN/OSC_OUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAN0_REMAP</name>
              <description>CAN0 alternate interface remapping</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER3_REMAP</name>
              <description>TIMER3 remapping</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER2_REMAP</name>
              <description>TIMER2 remapping</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER1_REMAP</name>
              <description>TIMER1 remapping</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER0_REMAP</name>
              <description>TIMER0 remapping</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USART2_REMAP</name>
              <description>USART2 remapping</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USART1_REMAP</name>
              <description>USART1 remapping</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART0_REMAP</name>
              <description>USART0 remapping</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C0_REMAP</name>
              <description>I2C0 remapping</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI0_REMAP</name>
              <description>SPI0 remapping</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS0</name>
          <displayName>EXTISS0</displayName>
          <description>EXTI sources selection register 0</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI3_SS</name>
              <description>EXTI 3 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
          </field>
           <field>
              <name>EXTI2_SS</name>
              <description>EXTI 2 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
          </field>
            <field>
              <name>EXTI1_SS</name>
              <description>EXTI 1 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
          </field>
            <field>
              <name>EXTI0_SS</name>
              <description>EXTI 0 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS1</name>
          <displayName>EXTISS1</displayName>
          <description>EXTI sources selection register 1</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI7_SS</name>
              <description>EXTI 7 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI6_SS</name>
              <description>EXTI 6 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI5_SS</name>
              <description>EXTI 5 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI4_SS</name>
              <description>EXTI 4 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS2</name>
          <displayName>EXTISS2</displayName>
          <description>EXTI sources selection register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI11_SS</name>
              <description>EXTI 11 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI10_SS</name>
              <description>EXTI 10 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI9_SS</name>
              <description>EXTI 9 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI8_SS</name>
              <description>EXTI 8 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS3</name>
          <displayName>EXTISS3</displayName>
          <description>EXTI sources selection register 3</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI15_SS</name>
              <description>EXTI 15 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI14_SS</name>
              <description>EXTI 14 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI13_SS</name>
              <description>EXTI 13 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI12_SS</name>
              <description>EXTI 12 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCF1</name>
          <displayName>PCF1</displayName>
          <description>AFIO port configuration register 1</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMC_NADV</name>
              <description>EXMC_NADV connect/disconnect</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER13_REMAP</name>
              <description>TIMER13 remapping</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER12_REMAP</name>
              <description>TIMER12 remapping</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER10_REMAP</name>
              <description>TIMER10 remapping</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER9_REMAP</name>
              <description>TIMER9 remapping</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER8_REMAP</name>
              <description>TIMER8 remapping</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
         <register>
          <name>PCF2</name>
          <displayName>PCF2</displayName>
          <description>AFIO port configuration register 2</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PH01_REMAP</name>
              <description>PH0/PH1 remapping</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCI_HSYNC_REMAP</name>
              <description>DCI_HSYNC remapping</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCI_D13_REMAP</name>
              <description>DCI_D13 remapping</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D12_REMAP</name>
              <description>DCI_D12 remapping</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCI_D11_REMAP</name>
              <description>DCI_D11 remapping</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D10_REMAP</name>
              <description>DCI_D10 remapping</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D9_REMAP</name>
              <description>DCI_D9 remapping</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D8_REMAP</name>
              <description>DCI_D8 remapping</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D7_REMAP</name>
              <description>DCI_D7 remapping</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D6_REMAP</name>
              <description>DCI_D6 remapping</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D5_REMAP</name>
              <description>DCI_D5 remapping</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D4_REMAP</name>
              <description>DCI_D4 remapping</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D3_REMAP</name>
              <description>DCI_D3 remapping</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D2_REMAP</name>
              <description>DCI_D2 remapping</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D1_REMAP</name>
              <description>DCI_D1 remapping</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_D0_REMAP</name>
              <description>DCI_D0 remapping</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCI_VSYNC_REMAP</name>
              <description>DCI_VSYNC remapping</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>

