CommunityGD32Cores/platform-gd32/misc/svd/GD32F20x_CL.svd
         <register>
          <name>PCF3</name>
          <displayName>PCF3</displayName>
          <description>AFIO port configuration register 3</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TLI_B3_PG11_REMAP</name>
              <description>TLI_B3_PG11 remapping</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B2_PG10_REMAP</name>
              <description>TLI_B2_PG10 remapping</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G3_PG10_REMAP</name>
              <description>TLI_G3_PG10 remapping</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_CLK_PG7_REMAP</name>
              <description>TLI_CLK_PG7 remapping</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R7_PG6_REMAP</name>
              <description>TLI_R7_PG6 remapping</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_DE_PF10_REMAP</name>
              <description>TLI_DE_PF10 remapping</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R7_PE15_REMAP</name>
              <description>TLI_R7_PE15 remapping</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_CLK_PE14_REMAP</name>
              <description>TLI_CLK_PE14 remapping</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_DE_PE13_REMAP</name>
              <description>TLI_DE_PE13 remapping</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B4_PE12_REMAP</name>
              <description>TLI_B4_PE12 remapping</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G3_PE11_REMAP</name>
              <description>TLI_G3_PE11 remapping</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G1_PE6_REMAP</name>
              <description>TLI_G1_PE6 remapping</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G0_PE5_REMAP</name>
              <description>TLI_G0_PE5 remapping</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B0_PE4_REMAP</name>
              <description>TLI_B0_PE4 remapping</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B3_PD10_REMAP</name>
              <description>TLI_B3_PD10 remapping</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B2_PD6_REMAP</name>
              <description>TLI_B2_PD6 remapping</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G7_PD3_REMAP</name>
              <description>TLI_G7_PD3 remapping</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R2_PC10_REMAP</name>
              <description>TLI_R2_PC10 remapping</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G6_PC7_REMAP</name>
              <description>TLI_G6_PC7 remapping</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_HSYNC_PC6_REMAP</name>
              <description>TLI_HSYNC_PC6 remapping</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G5_PB11_REMAP</name>
              <description>TLI_G5_PB11 remapping</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G4_PB10_REMAP</name>
              <description>TLI_G4_PB10 remapping</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B7_PB9_REMAP</name>
              <description>TLI_B7_PB9 remapping</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B6_PB8_REMAP</name>
              <description>TLI_B6_PB8 remapping</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R6_PB1_REMAP</name>
              <description>TLI_R6_PB1 remapping</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R3_PB0_REMAP</name>
              <description>TLI_R3_PB0 remapping</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R5_PA12_REMAP</name>
              <description>TLI_R5_PA12 remapping</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R4_PA11_REMAP</name>
              <description>TLI_R4_PA11 remapping</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R6_PA8_REMAP</name>
              <description>TLI_R6_PA8 remapping</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G2_PA6_REMAP</name>
              <description>TLI_G2_PA6 remapping</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_VSYNC_PA4_REMAP</name>
              <description>TLI_VSYNC_PA4 remapping</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B5_PA3_REMAP</name>
              <description>TLI_B5_PA3 remapping</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

         <register>
          <name>PCF4</name>
          <displayName>PCF4</displayName>
          <description>AFIO port configuration register 4</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>     
            <field>
              <name>SPI2_MOSI_REMAP</name>
              <description>SPI2_MOSI remapping</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1_SCK_REMAP</name>
              <description>SPI1_SCK remapping</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R1_PI3_REMAP</name>
              <description>TLI_R1_PI3 remapping</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R0_PH4_REMAP</name>
              <description>TLI_R0_PH4 remapping</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_HSYNC_PI10_REMAP</name>
              <description>TLI_HSYNC_PI10 remapping</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_VSYNC_PI9_REMAP</name>
              <description>TLI_VSYNC_PI9 remapping</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B7_PI7_REMAP</name>
              <description>TLI_B7_PI7 remapping</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B6_PI6_REMAP</name>
              <description>TLI_B6_PI6 remapping</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B5_PI5_REMAP</name>
              <description>TLI_B5_PI5 remapping</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B4_PI4_REMAP</name>
              <description>TLI_B4_PI4 remapping</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G7_PI2_REMAP</name>
              <description>TLI_G7_PI2 remapping</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G6_PI1_REMAP</name>
              <description>TLI_G6_PI1 remapping</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G5_PI0_REMAP</name>
              <description>TLI_G5_PI0 remapping</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G4_PH15_REMAP</name>
              <description>TLI_G4_PH15 remapping</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G3_PH14_REMAP</name>
              <description>TLI_G3_PH14 remapping</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_G2_PH13_REMAP</name>
              <description>TLI_G2_PH13 remapping</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R6_PH12_REMAP</name>
              <description>TLI_R6_PH12 remapping</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R5_PH11_REMAP</name>
              <description>TLI_R5_PH11 remapping</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R4_PH10_REMAP</name>
              <description>TLI_R4_PH10 remapping</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R3_PH9_REMAP</name>
              <description>TLI_R3_PH9 remapping</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R2_PH8_REMAP</name>
              <description>TLI_R2_PH8 remapping</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R1_PH3_REMAP</name>
              <description>TLI_R1_PH3 remapping</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_R0_PH2_REMAP</name>
              <description>TLI_R0_PH2 remapping</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B1_PG12_REMAP</name>
              <description>TLI_B1_PG12 remapping</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLI_B4_PG12_REMAP</name>
              <description>TLI_B4_PG12 remapping</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

         <register>
          <name>PCF5</name>
          <displayName>PCF5</displayName>
          <description>AFIO port configuration register 5</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>     
            <field>
              <name>EXMC_SDNE1_REMAP</name>
              <description>EXMC_SDNE1 remapping</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXMC_SDNE0_REMAP</name>
              <description>EXMC_SDNE0 remapping</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXMC_SDCKE1_REMAP</name>
              <description>EXMC_SDCKE1 remapping</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXMC_SDCKE0_REMAP</name>
              <description>EXMC_SDCKE0 remapping</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXMC_SDNWE_REMAP</name>
              <description>EXMC_SDNWE remapping</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART5_RX_REMAP</name>
              <description>USART5_RX remapping</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART5_TX_REMAP</name>
              <description>USART5_TX remapping</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART5_CTS_REMAP</name>
              <description>USART5_CTS remapping</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART5_RTS_REMAP</name>
              <description>USART5_RTS remapping</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART5_CK_REMAP</name>
              <description>USART5_CK remapping</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART6_REMAP</name>
              <description>UART6 remapping</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENET_RX_HI_REMAP</name>
              <description>ENET _RX_HI remapping</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENET_CRSCOL_REMAP</name>
              <description>ENET_CRSCOL remapping</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENET_TXD01_REMAP</name>
              <description>ENET_TXD01 remapping</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPS_HI_REMAP</name>
              <description>PPS_HI remapping</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENET_TXD3_REMAP</name>
              <description>ENET _TXD3 remapping</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAN0_ADD_REMAP</name>
              <description>CAN0_ADD remapping</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER11_REMAP</name>
              <description>TIMER11 remapping</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART3_REMAP</name>
              <description>UART3 remapping</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1_IO_REMAP</name>
              <description>SPI1_IO remapping</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPI1_NSCK_REMAP</name>
              <description>SPI1_NSCK remapping</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>I2C1_REMAP</name>
              <description>I2C1 remapping</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER7_CH_REMAP</name>
              <description>TIMER7_CH remapping</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER7_CHON_REMAP</name>
              <description>TIMER7_CHON remapping</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER4_REMAP</name>
              <description>TIMER4 remapping</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1_CH0_REMAP</name>
              <description>TIMER1_CH0 remapping</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2_REMAP1</name>
              <description>I2C2 remapping 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2_REMAP0</name>
              <description>I2C2 remapping 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

